{
  "pyqs": [
    {
      "question": "Explain intra-generational and inter-generational issues of equity from the perspective of inclusive growth and sustainable development. (Answer in 150 words)10",
      "year": "2020",
      "topics": [
        "Indian Economy and issues relating to Planning",
        " Mobilization of Resources",
        " Growth",
        " Development and Employment"
      ],
      "exam": "GS3"
    },
    {
      "question": "Define potential GDP and explain its determinants. What are the factors that have been inhibiting India from realizing its potential GDP? (Answer in 150 words)10",
      "year": "2020",
      "topics": [
        "Indian Economy and issues relating to Planning",
        " Mobilization of Resources",
        " Growth",
        " Development and Employment"
      ],
      "exam": "GS3"
    },
    {
      "question": "What are the main constraints in transport and marketing of agricultural produce in India? (Answer in 150 words)10",
      "year": "2020",
      "topics": [
        "Transport and Marketing of Agricultural Produce and Issues and Related Constraints"
      ],
      "exam": "GS3"
    },
    {
      "question": "What are the challenges and opportunities of food processing sector in the country? How can income of the farmers be substantially increased by encouraging food processing? (Answer in 150 words)10",
      "year": "2020",
      "topics": [
        "Food Processing and Related Industries in India- Scope’ and Significance",
        " Location",
        " Upstream and Downstream Requirements",
        " Supply Chain Management"
      ],
      "exam": "GS3"
    },
    {
      "question": "What do you understand by nanotechnology and how is it helping in health sector? (Answer in 150 words)10 ",
      "year": "2020",
      "topics": ["Nano-technology"],
      "exam": "GS3"
    },
    {
      "question": "How is science interwoven deeply with our lives? What are the striking changes in agriculture triggered off by the science-based technologies? (Answer in 150 words)10",
      "year": "2020",
      "topics": [
        "Science and Technology- Developments and their Applications and Effects in Everyday Life"
      ],
      "exam": "GS3"
    },
    {
      "question": "How does the draft Environment Impact Assessment (EIA) Notification, 2020 differ from the existing EIA Notification, 2006? (Answer in 150 words)10",
      "year": "2020",
      "topics": ["Environmental Impact Assessment"],
      "exam": "GS3"
    },
    {
      "question": "What are the salient features of the Jal Shakti Abhiyan launched by the Government of India for water conservation and water security? (Answer in 150 words)10",
      "year": "2020",
      "topics": ["Conservation"],
      "exam": "GS3"
    },
    {
      "question": "Discuss different types of cybercrimes and measures required to be taken to fight the menace. (Answer in 150 words)10",
      "year": "2020",
      "topics": ["Basics of Cyber Security"],
      "exam": "GS3"
    },
    {
      "question": "For effective border area management, discuss the steps required to be taken to deny local support to militants and also suggest ways to manage favourable perception among locals. (Answer in 150 words)10",
      "year": "2020",
      "topics": [
        "Security Challenges and their Management in Border Areas - Linkages of Organized Crime with Terrorism"
      ],
      "exam": "GS3"
    },
    {
      "question": "Explain the meaning of investment in an economy in terms of capital formation. Discuss the factors to be considered while designing a concession agreement between a public entity and a private entity. (Answer in 250 words) 15 ",
      "year": "2020",
      "topics": ["Investment Models"],
      "exam": "GS3"
    },
    {
      "question": "Explain the rationale behind the Goods and Services Tax (Compensation to States) Act of 2017. How has COVID-19 impacted the GST compensation fund and created new federal tensions? (Answer in 250 words) 15",
      "year": "2020",
      "topics": ["Government Budgeting"],
      "exam": "GS3"
    },
    {
      "question": "What are the major factors responsible for making rice-wheat system a success? In spite of this success how has this system become bane in India? (Answer in 250 words) 15",
      "year": "2020",
      "topics": [
        "Cropping Patterns in various parts of the country",
        " Issues related to Direct and Indirect Farm Subsidies and Minimum Support Prices"
      ],
      "exam": "GS3"
    },
    {
      "question": "Suggest measures to improve water storage and irrigation system to make its judicious use under depleting scenario. (Answer in 250 words) 15",
      "year": "2020",
      "topics": ["Different Types of Irrigation and Irrigation Systems"],
      "exam": "GS3"
    },
    {
      "question": "COVID-19 pandemic has caused unprecedented devastation worldwide. However, technological advancements are being availed readily to win over the crisis. Give an account of how technology was sought to aid management of the pandemic. (Answer in 250 words) 15\n",
      "year": "2020",
      "topics": [
        "Indigenization of Technology and Developing New Technology",
        " Science and Technology- Developments and their Applications and Effects in Everyday Life"
      ],
      "exam": "GS3"
    },
    {
      "question": "Describe the benefits of deriving electric energy from sunlight in contrast to the conventional energy generation. What are the initiatives offered by our Government for this purpose? (Answer in 250 words) 15",
      "year": "2020",
      "topics": [
        "Infrastructure: Energy",
        " Ports",
        " Roads",
        " Airports",
        " Railways etc"
      ],
      "exam": "GS3"
    },
    {
      "question": "What are the key features of the National Clean Air Programme (NCAP) initiated by the Government of India? (Answer in 250 words) 15",
      "year": "2020",
      "topics": ["Environmental Pollution and Degradation"],
      "exam": "GS3"
    },
    {
      "question": "Discuss the recent measures initiated in disaster management by the Government of India departing from the earlier reactive approach. (Answer in 250 words) 15",
      "year": "2020",
      "topics": ["Disaster and Disaster Management"],
      "exam": "GS3"
    },
    {
      "question": "What are the determinants of left-wing extremism in Eastern part of India? What strategy should Government of India, civil administration and security forces adopt to counter the threat in the affected areas? (Answer in 250 words) 15                                                \n",
      "year": "2020",
      "topics": ["Linkages between Development and Spread of Extremism"],
      "exam": "GS3"
    },
    {
      "question": "Analyse internal security threats and transborder crimes along Myanmar, Bangladesh and Pakistan borders including Line of Control (LoC). Also discuss the role played by various security forces in this regard. (Answer in 250 words) 15 ",
      "year": "2020",
      "topics": [
        "Security Challenges and their Management in Border Areas - Linkages of Organized Crime with Terrorism.\nVarious Security Forces and Agencies and their Mandate"
      ],
      "exam": "GS3"
    }
  ]
}
